# 문제 1) 0~9 까지 출력하는데:
#   1. 짝수만 출력
#   2. 5보다 큰 수만 출력
#   3. 3~7 까지만 출력 (and)
#   4. 0~2, 6~9 까지만 출력 (or)

num = 0  # 1. 초기식
while num < 10:  # 2. 조건식
    if num % 2 == 0:
        print(num)
    num += 1  # 3. 증감식
print("===========================================================")

num = 0
while num < 10:
    if num > 5:
        print(num)
    num += 1

print("===========================================================")

num = 0
while num < 10:
    if num >= 3 and num <= 7:
        print(num)
    num += 1

print("===========================================================")

num = 0
while num < 10:
    if num < 3 or num > 5:
        print(num)
    num += 1

