# 1. 입력 출력
# 2. 자료구조 ==> 1. 변수, 2. 리스트 (번호로 값 찾기, 값으로 번호 찾기), 3. 클래스
# 3. 알고리즘 ==> 1. 연산자, 2. 조건문 (if), 3. 반복문 (while), 4. 이중반복문

# 리스트
"""
1. 여러개의 대상을 묶어서 저장하는 것을 의미한다.
2. 리스트를 만드는 법 :
        리스트 변수 = [요소1, 요소2, 요소3, ....]
3. 리스트의 특징 :
        1) 리스트의 크기는 제한이 없다.
        2) 리스트 안에는 어떠한 자료형도 포함시킬 수 있다.
        3) 갯수에 따라 방번호 (인덱스) 가 매겨진다. (인덱스는 0부터 시작한다.)

"""

str1 = "안녕하세요"  # ㅁㅁㅁㅁㅁ ==> ㅁ
print(str1[0])
print(str1[1])
print(str1[2])
print(str1[3])
print(str1[4])

scores = [10, "20", 30, "철수", 5.4]  # ㅁㅁㅁㅁㅁ ==> ㅁ
print(scores[0])
print(scores[1])
