"""
# 1. 입력 출력
# 2. 저장 ==> 자료구조 ==> 1. 변수 , 2. 리스트  ,  3.함수,  클래스(함수여러개)
# 3. 수정 ==> 알고리즘 ==> 1. 연산자 , 2. if(조건문) , 3. 반복문(while) , 4. 이중반복문 , 5.정렬
"""
# 리스트
lst = [1, 20, 30, 2, 6]
# 1.  인덱스를 입력받고 값출력
# 2.  값을 입력받고 인덱스 출력
# 3.  전체 합출력
# 4.  인덱스 2개입력받고 교환
# 5.  가장큰값찾기
# 6.  셔플
APT = [[101, 102, 103, 104],
       [201, 202, 203, 204],
       [301, 302, 303, 304]]
PAY = [[1000, 2010, 3010, 2100],
       [7200, 4200, 2200, 5200],
       [5300, 3800, 11300, 3300]]
# 이중반복문
# 1. 각층별 관리비 합계
# 2. 우리집은 202호 우리집 관리비 출력
# 3. 우리집관리비와 201호 관리비가 바꿔서 나왔다 교환후 출력
# 4. 가장 관리비 많이 나온집 호수 출력
# 5. (심화) 가장 많이 나온집 순서대로 출력
"""
*
**
***
***
**
*
  *
 **
***
***
 **
  *
"""


