# 구구단 전체 출력
"""
range(10)  # 0 ~ 9
range(2, 10)  # 2 ~ 9
for i in range(2, 10):  # 사이값  # 세로
    for j in range(1, 10):  # 가로
        print("%d * %d = %d"% (i, j, i*j))

    print()
"""
APT = [[101, 102, 103, 104],
       [201, 202, 203, 204],
       [301, 302, 303, 304]]
print(APT[0])
print(APT[0][0])

# 문제 1) 303 호의 인덱스를 출력
# 문제 1.1) 전체 합 출력
# 문제 2) 각 가로 의 합
# 문제 3) 각 세로의 합
"""
# 1. 입력 출력
# 2. 자료구조 ==> 1. 변수 , 2. 리스트  , 3.함수, 클래스(함수여러개))
# 3. 알고리즘 ==> 1. 연산자 , 2. if(조건문) , 3. 반복문(while) , 4. 이중반복문
"""
